app/views/groups/index.html.erb

SELECT `users`.* FROM `users`
---
                  <%= f.label :user_id %><br />
                   <%= collection_select(:group,:user_id,User.all,:id,:name, { :prompt => "Select Users"},class: "form-control")  %>