app/views/groups/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
                  <%= f.label :user_id %><br />
                   <%= f.collection_select(:user_id,User.where("id !=?",current_user.id),:id,:name, { :prompt => "Select Users"},class: "form-control")  %>

SELECT `group_members`.* FROM `group_members` WHERE `group_members`.`group_id` = 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`group_id` = 1
---
        </h4>
          <% group.group_members.each  do |groupmember| %>