app/views/groups/show.html.erb

                  <%= f.label :user_id %><br />
                   <%= f.collection_select(:user_id,User.where("id !=?",current_user.id),:id,:name, { :prompt => "Select Users"},class: "form-control")  %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1