app/controllers/group_members_controller.rb

  def index
    @group_members = GroupMember.all
---
SELECT `group_members`.* FROM `group_members`

  def create
    # where("id !=?",current_user.id)
    # abort(params[:group_id])
    if(params[:user_id])
      @group_member = GroupMember.new
      @group_member.group_id = params[:group_id]
      @group_member.user_id = params[:user_id]
      @notify = Notification.new
      @notify.user_id= current_user.id
      @notify.content = 'has add new user to group named  "'+@group_member.group.name+'"'
      @notify.url = "/groups/"+@group_member.group.id.to_s
      @notify.save
---
INSERT INTO `group_members` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2016-05-21 07:53:30', '2016-05-21 07:53:30')

  def destroy
    num = @group_member.group_id
    @group_member.destroy
---
DELETE FROM `group_members` WHERE `group_members`.`id` = 2

    def set_group_member
      @group_member = GroupMember.find(params[:id])
---
SELECT  `group_members`.* FROM `group_members` WHERE `group_members`.`id` = 2 LIMIT 1