app/controllers/groups_controller.rb

  def index
    if(current_user)
      @groups = Group.all
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`group_id` = 1

  def show
    # @members = GroupMember.find(@user.id, :include => :comments)
    @members = GroupMember.where( 'group_id = '+params[:id]).pluck(:user_id)
    @friends_of_user = []
    for userFriend in current_user.friend1 do
      @friends_of_user << User.where('id IN (?)',userFriend.friend_id).pluck(:id)
    end
    if(@members.count > 0)
      @friend_users = User.where('id IN (?)',@friends_of_user.map(&:first)).where('id NOT IN (?)',@members)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    if(current_user)
      if(group_params[:name])
        @group = Group.new(group_params)
        @group.user_id= current_user.id

        respond_to do |format|
          if @group.save
---
INSERT INTO `groups` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('Open Source', 1, '2016-05-18 18:55:47', '2016-05-18 18:55:47')

  def destroy
    @group.group_members.destroy
---
DELETE FROM `groups` WHERE `groups`.`id` = 2