app/controllers/orders_controller.rb

  def index
    if(current_user)
       @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def create
    if(current_user)
      @order = Order.new(order_params)
      # @order.avatar = params[:file] # Assign a file like this, or
      @order.user_id = current_user.id

      respond_to do |format|
        if @order.save
---
INSERT INTO `orders` (`name`, `resturant`, `status`, `image`, `user_id`, `created_at`, `updated_at`) VALUES ('order from EL-typat', 'El typat restraunt', 1, '#<ActionDispatch::Http::UploadedFile:0x007fbce8311238>', 1, '2016-05-18 17:00:02', '2016-05-18 17:00:02')