app/controllers/users_controller.rb

  def index
    if(current_user)
      @users = User.all
      # @orders = Order.all
      # @orders = Order.find( :all,conditions: { user_id: current_user.id })
      @orders = Order.last(5).reverse
      @notifications = []

      for userFriend in current_user.friend1 do
        @notifications << Notification.where(user_id:userFriend.friend_id)
---
SELECT `users`.* FROM `users`
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 1