app/controllers/users_controller.rb

  def index
    if(current_user)
      @users = User.all
      # @orders = Order.all
      # @orders = Order.find( :all,conditions: { user_id: current_user.id })
      @orders = Order.where(user_id: current_user.id)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1